# user1 test-user
Review.create!(day: '2019-07-12', comment:"初めて勉強したプログラミング言語がRubyでした。
プログラミング未経験の状態から、「Progate」→「たのしいRuby」→「Railsチュートリアル」とこなし、本書に取り組みました。
カバーしている内容は「たのしいRuby」とほぼ変わりませんが、「たのしいRuby」と比べて説明が格段に分かりやすいです。
特に「たのしいRuby」ではProcとyieldの部分がほとんど理解出来なかったのですが、本書を読んでしっかり理解出来ました。
初めての言語がRubyという方にも、Progateなどで触りをやった後などにオススメです。
読破にかかった時間は、「9日間・31時間程度」でした", user_id: 1, book_id: 1, created_at: "2019-07-01 03:03:43", updated_at: "2019-07-01 03:03:43")
Review.create!(day: '2019-07-12',
 comment: "私はプログラミング初心者なので、この本を読むには早かったのかもしれませんが、どうして他の人のコードは自分のものと比べて読みやすいのか？を言葉で説明してくれた本でした。
自分のコーディングスキルの上達に合わせて、この本の内容がしっくりくるようになると思いました。",
 user_id: 1, book_id: 7, created_at: "2019-07-01 03:03:43", updated_at: "2019-07-01 03:03:43")

#  user2 girl
Review.create!(day: '2019-07-04', comment: "1周終わりました。
パッとみ大した事なさそうだなと思ってたけど、やってみると難しかったです。
けれど解説が丁寧なので最後までがんばれました。",user_id: 2, book_id: 2, created_at: "2019-07-04 03:03:43", updated_at: "2019-07-04 03:03:43")

# user3 man
Review.create!(day: '2019-07-10',
 comment: "プログラミングをする上での命名ルールやコードの作法を解説している。
 独学でプログラミングを勉強している人は早いうちに読んでおくと、他人のコードを読む時に楽になるかもしれない。",
 user_id: 3, book_id: 7, created_at: "2019-07-10 03:03:43", updated_at: "2019-07-10 03:03:43")

# user4 old-woman
Review.create!(day: '2019-06-06',
 comment: "印象に残ったのは以下の二つです。
 ・再帰的な構造を持ったDBの扱い方
 これを２章に持ってくるのは、読み手をかなり選んでいる気がしました。実践的な意味で、これらを使う場面はそんなに多くない印象だと思いました。
 ・「NULLの取扱い」
 NULLに対しては、結局「NULLを素通りするな。NULLがあるのか、あるならそれは何かを明らかにして選択せよ」と言っているので、アンチパターンというよりは、考え方の提示を促しているだけに見え、筆者なりの価値観を提示してほしかったです。
 ",
 user_id: 4, book_id: 11, created_at: "2019-06-06 03:03:43", updated_at: "2019-06-06 03:03:43")
Review.create!(day: '2019-07-01',
 comment: "このシリーズは全て購入しましたが、基本から実際の運用に関わる部分まで網羅されており、イメージを掴むのにとても長けています。構成も見開きで纏まっており優れています。これから勉強する方や全体像だけ知りたい方に非常にお勧めです。
 深い知識が必要な方も、これを読んでから更に踏み込んだ書籍を読むと良いと思います。",
 user_id: 4, book_id: 3, created_at: "2019-07-01 03:03:43", updated_at: "2019-07-01 03:03:43")


